package org.example;

/*
Создайте проект, используя Maven с архетипом quickstart.
В проект добавьте зависимости на такие инструменты как JUnit 5, Selenium.
*/
public class App {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
