package org.example;

/*
Создайте проект, используя Gradle.
В проект добавьте зависимости на такие инструменты как JUnit 5, Selenium.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}