package org.example;

/*
 Практическое задание Л16
 Перейдите в сервис Postman.
 Войдите в свой аккаунт и скачайте себе коллекцию Postman Echo.
 Написать автотесты для каждого метода из папки Request Methods
 (проверка тела ответа (просто сравнить значения всех полей) и кода ответа).
*/
public class App 
{
    public static void main( String[] args )
    {
        System.out.println( "Hello World!" );
    }
}
